Revit 2027 API
BuiltInFailures.WallFailures.CannotUpdateWallPanel Property
 Unable to update wall panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUpdateWallPanel { get; }
Public Shared ReadOnly Property CannotUpdateWallPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUpdateWallPanel {
	FailureDefinitionId^ get ();
}
static member CannotUpdateWallPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace